app/controllers/callbacks_controller.rb

UPDATE "users" SET "id" = ?, "email" = ?, "encrypted_password" = ?, "created_at" = ?, "updated_at" = ?, "name" = ?, "role" = ?, "provider" = ?, "uid" = ?, "profileurl" = ?, "gender" = ?, "picture" = ?, "timezone" = ?, "firstname" = ? WHERE "users"."id" = ?
---
    def facebook

        #store info on user who is referrering


        @user = User.from_omniauth(request.env["omniauth.auth"])




        sign_in_and_redirect @user

        if request.referer == nil
            code =
            current_user.update_attributes(:referral_code => code)