app/controllers/callbacks_controller.rb

UPDATE "users" SET "current_sign_in_at" = $1, "last_sign_in_at" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["current_sign_in_at", 2017-02-09 23:26:42 UTC], ["last_sign_in_at", 2017-02-09 22:07:05 UTC], ["sign_in_count", 3], ["updated_at", 2017-02-09 23:26:42 UTC], ["id", 1]]
---
    def facebook

        #store info on user who is referrering


        @user = User.from_omniauth(request.env["omniauth.auth"])




        sign_in_and_redirect @user

        if request.referer == nil
            code =
            current_user.update_attributes(:referral_code => code)