app/controllers/feedbacks_controller.rb

  def create
    @feedback = current_user.feedbacks.build(feedback_params)
    @feedback.user_id = current_user.id

    respond_to do |format|
      if @feedback.save
---
INSERT INTO "feedbacks" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", ""], ["user_id", 10], ["created_at", 2017-04-19 17:35:07 UTC], ["updated_at", 2017-04-19 17:35:07 UTC]]