app/controllers/influencers_controller.rb

SELECT "influencers".* FROM "influencers"
---
  def index
    @influencers = Influencer.all

INSERT INTO "influencers" ("created_at", "updated_at", "name", "description", "industry", "style") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", 2017-05-26 17:58:38 UTC], ["updated_at", 2017-05-26 17:58:38 UTC], ["name", "Aaron Francis "], ["description", "Morehouse 14"], ["industry", "Advocates"], ["style", "Earn"]]
---
  def create
    @influencer = current_user.influencers.build(influencer_params)

    respond_to do |format|
      if @influencer.save

UPDATE "influencers" SET "image" = ?, "updated_at" = ? WHERE "influencers"."id" = ?  [["image", "https://media.licdn.com/mpr/mpr/shrinknp_200_200/AAEAAQAAAAAAAAOAAAAAJDg0OWZmMGI4LTFjOTQtNGQwYy1hMzRkLWEwOGIxNzlhNGIzYw.jpg"], ["updated_at", 2017-05-29 19:09:52 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @influencer.update(influencer_params)

SELECT  "influencers".* FROM "influencers" WHERE "influencers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_influencer
      @influencer = Influencer.find(params[:id])