app/controllers/profile_controller.rb

SELECT  "tips".* FROM "tips" WHERE "tips"."prep" = ? ORDER BY created_at DESC LIMIT ?  [["prep", "cover_letters"], ["LIMIT", 5]]
---
    def playlist
        if user_signed_in?
            @user = current_user
        else
            @user = User.find_by_profileurl(params[:profileurl])
        end

        #render modals
        if @jobs != nil
            @jobs= Job.order("created_at DESC").limit(0).where
        end



            @tips= Tip.order("created_at DESC").where(:prep => @user.prep).limit(5)