app/controllers/profile_controller.rb

    def index


        @users_all = User.all
        @user_count= User.all.count
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"

    def show
        @user = User.find_by_profileurl(params[:profileurl])
---
SELECT  "users".* FROM "users" WHERE "users"."profileurl" = ? LIMIT ?  [["profileurl", "America Needs You"], ["LIMIT", 1]]

        else
            @city = request.location.city
            if user_signed_in? and current_user.hometown == "nil"
                current_user.update_attribute(:hometown, @city)
---
UPDATE "users" SET "hometown" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["hometown", "Pompton Plains"], ["updated_at", 2017-07-05 15:41:50 UTC], ["id", 1]]