app/controllers/tips_controller.rb

SELECT "tips".* FROM "tips" WHERE (title LIKE '%resume%' OR body LIKE '%resume%')
---
  def index
    if params[:search]
      @tips = Tip.search(params[:search])

INSERT INTO "tips" ("title", "body", "industry", "link", "created_at", "updated_at", "prep", "grad", "for_email", "gradyear") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tip = Tip.new(tip_params)

    respond_to do |format|
      if @tip.save

UPDATE "tips" SET "title" = ?, "grad" = ?, "updated_at" = ? WHERE "tips"."id" = ?  [["title", "Getting Into Law School : Your Ultimate Guide "], ["grad", "Law School"], ["updated_at", 2017-05-29 19:28:13 UTC], ["id", 6]]
---
  def update
    respond_to do |format|
      if @tip.update(tip_params)

SELECT  "tips".* FROM "tips" WHERE "tips"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def set_tip
      @tip = Tip.find(params[:id])