app/controllers/university_controller.rb

    def set_feed
        if user_signed_in? and current_user.prep != nil
            else
                @user = current_user
            end

            #render modals
            if @jobs != nil
                @jobs= Job.order("created_at DESC").limit(0).where
            end


           #render resources
            if user_signed_in? and current_user.prep != nil
                if params[:search]
      		    	@tips = Tip.search(params[:search])
      			else
                    @tips= Tip.all
                end
            end

            if user_signed_in? and current_user.industry != nil
                @influencers= Influencer.all
---
SELECT "tips".* FROM "tips"
SELECT "influencers".* FROM "influencers"