app/controllers/visions_controller.rb

SELECT  "tips".* FROM "tips" WHERE "tips"."prep" = ? ORDER BY created_at DESC LIMIT ?  [["prep", "revise_resume"], ["LIMIT", 5]]
---
  def show
    #track visits with AHOY





    #render modals

    @jobs= Job.order("created_at DESC").limit(2).where(:industry => @vision.industry)

    @tips_job= Tip.order("created_at DESC").where(:prep => @vision.prep).limit(5)

INSERT INTO "feedbacks" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", 2017-04-05 02:33:54 UTC], ["updated_at", 2017-04-05 02:33:54 UTC]]
---
    @feedback.user_id = current_user.id

      respond_to do |format|
            if @feedback.save

INSERT INTO "visions" ("industry", "style", "created_at", "updated_at", "user_id", "prep", "firstjob", "username", "email", "image", "gender", "timezone", "age") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @vision = current_user.visions.build(vision_params)

    respond_to do |format|
      if @vision.save

UPDATE "visions" SET "industry" = ?, "firstjob" = ?, "style" = ?, "prep" = ?, "career_services" = ?, "linkedin" = ?, "gradschool" = ?, "school" = ?, "gradyear" = ?, "major" = ?, "updated_at" = ? WHERE "visions"."id" = ?
UPDATE "users" SET "updated_at" = ?, "school" = ? WHERE "users"."id" = ?  [["updated_at", 2017-04-05 18:43:15 UTC], ["school", "School"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @vision.update(vision_params)
        format.html
        format.json { render :show, status: :ok, location: @vision }

        #if can't pull user info from FB, update info from visions form
        current_user.update_attribute(:major, @vision.major)

SELECT  "visions".* FROM "visions" WHERE "visions"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_vision
      @vision = Vision.find(params[:id])