app/controllers/visions_controller.rb

INSERT INTO "visions" ("created_at", "updated_at", "user_id", "prep", "firstjob", "username", "email", "image", "gender", "timezone", "age") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @vision = current_user.visions.build(vision_params)

    respond_to do |format|
      if @vision.save

UPDATE "visions" SET "industry" = $1, "prep" = $2, "career_services" = $3, "linkedin" = $4, "gradschool" = $5, "school" = $6, "major" = $7, "updated_at" = $8 WHERE "visions"."id" = $9  [["industry", 0], ["prep", "cover_letters"], ["career_services", ""], ["linkedin", ""], ["gradschool", ""], ["school", ""], ["major", ""], ["updated_at", 2017-02-09 23:54:06 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @vision.update(vision_params)